In [13]:
import pandas as pd

In [14]:
path = "./data/BX-Books.csv"

In [19]:
books = pd.read_csv(path, sep=';', on_bad_lines='skip', encoding='latin-1',low_memory=False)

In [28]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [31]:
books = books[['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher','Image-URL-L']]

In [34]:
books.rename(columns={
    'Book-Title':'Title',
    'Book-Author':'Author',
    'Year-Of-Publication':'Year',
    'Image-URL-L':'Img-url',
}, inplace=True)

In [35]:
books.head(2)

,ISBN,Title,Author,Year,Publisher,Img-url
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...

In [42]:
users = pd.read_csv("./data/BX-Users.csv", sep=";", on_bad_lines="skip", encoding="latin-1")

In [45]:
users.rename(columns={
    'User-ID': 'user-id',
    'Location': 'location',
    'Age': 'age',
}, inplace=True)

In [47]:
users.head()

   user-id                            location   age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [49]:
rating = pd.read_csv("./data/BX-Book-Ratings.csv", sep=";", on_bad_lines="skip", encoding='latin-1')

In [50]:
rating.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [51]:
rating.rename(columns={
    'User-ID': 'user-id',
    'ISBN' : 'isbn',
    'Book-Rating' : 'book-rating'
}, inplace=True)

In [52]:
rating.head()

   user-id        isbn  book-rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [56]:
print(books.shape, users.shape, rating.shape, sep='\n')

(271360, 6)
(278858, 3)
(1149780, 3)